# Message texts
WELCOME_MESSAGE = 'Welcome to Ikigai bot! 🎉'
SELECT_WORKPLACE_MESSAGE = 'Какое рабочее место Вам нужно?'
SELECT_TIME_MESSAGE = 'How much time do you need?'
SELECT_DATE_MESSAGE = 'Выберете подходящий для вас день:'
SELECT_TIME_SLOT_MESSAGE = 'Выбетере подходящее для вас время'
SELECT_SEAT_MESSAGE = 'Выберете рабочее место.'


INFO_MESSAGE = '''*Beauty Coworking ikigai* - это рабочее пространство для профессионалов индустрии красоты. 

- Мы предоставляем удобные и функциональные рабочие места для визажистов, бровистов и стилистов, которые ценят комфорт и качество в своей работе.

- Мы создали Beauty Coworking с целью поддерживать начинающих предпринимателей в их деловом росте.

- Наша миссия - предоставить доступное и функциональное пространство для работы и развития вашего бизнеса в области красоты.

*Присоединяйтесь к Beauty Coworking ikigai* и обеспечьте себе идеальное рабочее окружение для достижения профессиональных целей в индустрии красоты.
'''


MY_RESERVATIONS_MESSAGE = 'Ваши резервации:'
MY_RESERVATIONS_MESSAGE_NO_RESERVATIONS = 'У Вас пока нет ни одной активной резервации.'
RESERVATION_NOT_FOUND_MESSAGE = "Резервация не найдена..."

ADMIN_CHAT_MESSAGE = 'Оставьте свое сообщение здесь и мы перешлем его администратору.'

# Button texts
NEW_RESERVATION_BUTTON = '🆕 Новая резервация'
MY_RESERVATIONS_BUTTON = '🆕 Мои резервации'
ABOUT_US_BUTTON = '⏺️ О нас'
BACK_BUTTON = '🔙 Назад'
PAY_NOW_BUTTON = 'Оплатить 🪙'
PAY_DONE_BUTTON = 'Готово ✅'
PAY_URL = 'http://revolut.me/yuliyagb1b'
PAY_LATER_BUTTON = 'Оплатить позже ⌛'
CANCEL_RESERVATION_BUTTON = 'Отменить резервацию'

# Time slot buttons
ONE_HOUR_BUTTON = '🕐 1 час'
TWO_HOURS_BUTTON = '🕐 2 часа'
THREE_HOURS_BUTTON = '🕐 3 часа'
SIX_HOURS_BUTTON = '🕐 6 часов (полдня)'
OTHER_HOURS_BUTTON = 'Other...'

# Workplace types
HAIRSTYLE_BUTTON = 'Hairstyle'
BROWS_BUTTON = 'Brows'